<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件

// 评论显示替换表情标签
function reFace($str){
    for($i=1;$i<76;$i++){

        $str = str_replace("[em_$i]","<img src='__STATIC__/index/Face/$i.gif'/>",$str);
    }
    return $str;
}